<a href="https://colab.research.google.com/github/Syarafina-Dewi/data-analytics/blob/main/Topic_6_Data_Preprocessing_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Topic 6 - Python for Data Analysis : Data Preprocessing with Pandas

# Join

Using two of the dataframes below, answer the questions :

In [ ]:
df1 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
                   
df2=pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                      'B': ['B0', 'B1', 'B2']})

In [ ]:
#import libraries here
import pandas as pd

### Create a dataframe (df3) which consists both dataframe inner-joined by column "Key" (5 pts)

In [ ]:
#code goes here
df3 = pd.merge(df1, df2, on='key', how='inner')
df3

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

### Create a dataframe (df4) which consists of the result of df1 and df2 left-joined by column "Key" (10pts)

In [ ]:
#code goes here
df4 = pd.merge(df1, df2, on='key', how='left')
df4

  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K2  A2   B2
3  K3  A3  NaN
4  K4  A4  NaN
5  K5  A5  NaN

#### 1. Replace key "K2" into "K3" on df1
#### 2. Left join it with df2 
(15pts)

In [ ]:
#code goes here
df1_update = df1.replace({'key' : 'K2'}, {'key' : 'K3'})
df1_update2 = pd.merge(df1_update,df2,how="left")
df1_update2

  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K3  A2  NaN
3  K3  A3  NaN
4  K4  A4  NaN
5  K5  A5  NaN

# Dataframe Processing

Create a dictionary and convert it to a dataframe called "Customer_df" (15 pts)


name=['Anna','Jason','Cindy']

age=['22','23','21']

gender=['F','M','F']

In [ ]:
#code goes here
Customer_df={
    "name":['Anna','Jason','Cindy'],
    "age":[22, 23, 21],
    "gender":['F','M','F']
}

df1=pd.DataFrame(Customer_df)
df1

    name  age gender
0   Anna   22      F
1  Jason   23      M
2  Cindy   21      F

### Delete the "age" column (5 pts)

In [ ]:
#code goes here
del df1["age"]
df1

    name gender
0   Anna      F
1  Jason      M
2  Cindy      F

### Rename the "name" column into "first name" (10 pts)

In [ ]:
#code goes here
renamed_columns={'name':'first name'}
df1=df1.rename(columns=renamed_columns)
df1

  first name gender
0       Anna      F
1      Jason      M
2      Cindy      F

### Sort the dataframe by age, descending (10 pts)

In [ ]:
#code goes here
df2=pd.DataFrame(Customer_df)
df2
df2.sort_values('age',ascending=False)

    name  age gender
1  Jason   23      M
0   Anna   22      F
2  Cindy   21      F

## Run the code below for data source and answer the following questions

In [ ]:
import pandas as pd
df=pd.read_csv('http://bit.ly/kaggletrain')

### Show top 10 rows of the dataset (5 pts)

In [ ]:
#code goes here
df_top=df.head(10)
df_top

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

## Using data aggregation in pandas , Answer the question below:

Show the total amount of passengers who survived and not survived (10pts)

In [ ]:
#code goes here
df2=pd.read_csv('http://bit.ly/kaggletrain')

df2.groupby('Survived').count()['PassengerId']

Survived
0    549
1    342
Name: PassengerId, dtype: int64

Show all male survivors from titanic incident (10 pts)

In [ ]:
#code goes here
male_data = df.loc[
    (df['Sex'] == 'male') &
    (df['Survived'] > 0)]
male_data = male_data.drop(['PassengerId','Pclass','SibSp','Parch','Ticket','Cabin','Fare','Embarked'], axis=1)
male_data.sum()

Survived                                                  109
Name        Williams, Mr. Charles EugeneBeesley, Mr. Lawre...
Sex         malemalemalemalemalemalemalemalemalemalemalema...
Age                                                   2536.67
dtype: object

Show the average fare paid based on gender (10 pts)

In [ ]:
#code goes here
df.groupby('Sex').mean()['Fare']

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

Show the total amount of passengers who survived and not survived based on gender (10pts)

In [ ]:
df2[['Sex', 'Survived', 'Pclass']].groupby(['Sex', 'Survived']).count()

                 Pclass
Sex    Survived
female 0             81
       1            233
male   0            468
       1            109